#+TITLE:   ETUDE EMACS
#+AUTHOR:  Chris Zheng
#+EMAIL:   z@caudate.me
#+STARTUP: showall

** Ubuntu

For installation

#+BEGIN_SRC shell :os ubuntu
apt install bat fd tree fzf ripgrep ispell
#+END_SRC

It's now possible to

#+BEGIN_SRC js
var a = 4
var b = 3

return a + b
#+END_SRC

#+RESULTS:
: 7


-------------
| B | A | C |
|---|---|---|
| 2 | 1 | 3 |
| b | a | c |

#+BEGIN_SRC md.graph

                 _______            
  .-------.     /      /   .-----.  
  | Write +-+->/ Edit ++->| Share |   
  '-------' ^ /______/ |   '-----'  
            |          |            
             '--------'             

#+END_SRC



#+BEGIN_SRC md.graph
  A         B         C   
  *-------->o<------->o   
  ^        / ^        |   
  |       v   \       v   
  o----->o---->o<---->*   
  D      E     F      G   
#+END_SRC


this is something pretty crazy
